public class Main {
    public static void main(String[] args) {
        //Этот комментарий просто для изменений в коде, чтобы создать пулл-реквест в ручную.
        System.out.println("_________________________________________________________________________________________");
        System.out.println("___________________________________Циклы. Часть 1._______________________________________");
        System.out.println("_________________________________________________________________________________________");
        System.out.println("______________________________________Задача 1___________________________________________");
        System.out.println("_________________________________________________________________________________________");
        //Задача 1
        //С помощью цикла for выведите в консоль все числа от 1 до 10.

        int i;
        // Idea заставила объявить i, хотя на видео работало и без этого. Объясните этот момент при проверке,
        // если не трудно =)

        for (i = 0; i <= 10; i++) {
            System.out.println("Итерация цикла " + i);
        }
// Просто использовал код, который был в видео.
        System.out.println("_________________________________________________________________________________________");
        System.out.println("______________________________________Задача 2___________________________________________");
        System.out.println("_________________________________________________________________________________________");
        //Задача 2
        //С помощью цикла for выведите в консоль все числа от 10 до 1.

        for (i = 10; i >= 0; i--) {
            System.out.println("Итерация цикла " + i);
        }

        System.out.println("_________________________________________________________________________________________");
        System.out.println("______________________________________Задача 3___________________________________________");
        System.out.println("_________________________________________________________________________________________");
        //Задача 3
        //Выведите в консоль все четные числа от 0 до 17.
        for (i = 0; i <= 17; i = i + 2) {
            System.out.println("Четное число " + i);
        }

        System.out.println("_________________________________________________________________________________________");
        System.out.println("______________________________________Задача 4___________________________________________");
        System.out.println("_________________________________________________________________________________________");
        //Задача 4
        //Выведите в консоль все числа от 10 до −10 от бо́льшего числа к меньшему.

        for (i = 10; i >= -10; i--) {
            System.out.println("i = " + i);
        }

        System.out.println("_________________________________________________________________________________________");
        System.out.println("______________________________________Задача 5___________________________________________");
        System.out.println("_________________________________________________________________________________________");
        //Задача 5
        //Напишите программу, которая выводит в консоль все високосные года, начиная с 1904 года до 2096.
        //В консоль результат должен выводиться в формате: «… год является високосным».

        for (i = 1904; i <= 2096; i = i + 4) {
            System.out.println("i = " + i);
        }
        System.out.println("_________________________________________________________________________________________");
        System.out.println("______________________________________Задача 6___________________________________________");
        System.out.println("_________________________________________________________________________________________");
        //Задача 6
        //Напишите программу, которая выводит в консоль последовательность чисел:
        //
        //7 14 21 28 35 42 49 56 63 70 77 84 91 98

        for (i = 7; i <= 98; i = i + 7) {
            System.out.println("Число кратное семи: " + i);
        }
        System.out.println("_________________________________________________________________________________________");
        System.out.println("______________________________________Задача 7___________________________________________");
        System.out.println("_________________________________________________________________________________________");
        //Задача 7
        //Напишите программу, которая выводит в консоль последовательность чисел:
        //
        //1 2 4 8 16 32 64 128 256 512

        for (i = 1; i <= 512; i = i * 2) {
            System.out.println("Умножаемся на 2: " + i);
        }
        //Умножаемся, потому что надо вывести 1. Без единицы можно было бы в степень двойку возводить.
        System.out.println("_________________________________________________________________________________________");
        System.out.println("______________________________________Задача 8___________________________________________");
        System.out.println("_________________________________________________________________________________________");
        //Задача 8
        //Посчитайте с помощью цикла for сумму годовых накоплений, если каждый месяц вы будете откладывать по 29 000 рублей «в банку».
        //
        //Выведите сумму накоплений за каждый месяц в консоль в формате: «Месяц …, сумма накоплений равна … рублей».
        int savingsPerMonth = 29000;
        int totalPerMonth = 0;
        for (i = 1; i <= 12; i ++) {
            totalPerMonth = totalPerMonth + savingsPerMonth;
            System.out.println("Копим " + i + " месяцев. " + "В банке 'Нэскафе' сейчас: " + totalPerMonth);
        }
        System.out.println("_________________________________________________________________________________________");
        System.out.println("______________________________________Задача 9___________________________________________");
        System.out.println("_________________________________________________________________________________________");
        //Задача 9
        //Перепишите решение задачи выше при условии, что деньги вы откладывать будете не «в банку», а в банк под
        // проценты — 12% годовых. Выведите сумму накоплений за каждый месяц в консоль в формате: «Месяц …, сумма накоплений равна … рублей».

        int totalInBank = 0;
        for (i = 1; i <= 12; i ++) {
            totalInBank = totalInBank + totalInBank/100;
            totalInBank = totalInBank + savingsPerMonth;
            System.out.println("Копим " + i + " месяцев. " + "В банке 'ЗверБанк' сейчас: " + totalInBank);
        }
        System.out.println("_________________________________________________________________________________________");
        System.out.println("_____________________________________Задача 10___________________________________________");
        System.out.println("_________________________________________________________________________________________");
        //Задача 10
        //Напишите программу, которая выводит в консоль таблицу умножения на 2:
        //
        //2*1=2
        //
        //2*2=4
        //
        //2*3=6
        //
        //2*4=8
        //
        //2*5=10
        //
        //2*6=12
        //
        //2*7=14
        //
        //2*8=16
        //
        //2*9=18
        //
        //2*10=20

        var res = 0;

        for (i = 1; i <= 10; i ++) {
            res = i*2;
            System.out.println("2*" + i + "=" + res);
        }

    }

}